# HeadOnPlacementMethod Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HeadOnPlacementMethod Property
ParameterTypeId Class See Also
---
"Draw in Foreground"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HeadOnPlacementMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HeadOnPlacementMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HeadOnPlacementMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace